Update docs: switched to mermaid diagrams
